zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/m0p/hw_factoryregion.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

/**
 * @file hw_factoryregion.h
 * @brief MSPM0 FACTORYREGION (工厂配置区域) 外设寄存器定义
 *
 * FACTORYREGION 模块存储芯片出厂时的配置和校准数据:
 *   - 设备标识: TRACEID (ATE追踪ID)、DEVICEID (JTAG ID)、USERID (用户标识/变体/版本)
 *   - BSL引脚配置: UART/I2C的RXD/TXD/SDA/SCL引脚分配及功能选择，BSL调用引脚配置
 *   - 存储器大小: MAINFLASH/SRAM/DATAFLASH容量 (单位KB)、MAIN FLASH Bank数量
 *   - PLL启动参数: 4组频率范围 (4-8/8-16/16-32/32-48MHz) 的启动时间、电荷泵电流、环路滤波器参数
 *   - 温度传感器: 室温校准码 (TEMP_SENSE0)
 *   - 引导CRC: BOOTCRC 记录OPEN区域的32位CRC校验值
 *
 * @note 所有寄存器均为只读，数据在芯片制造时由ATE (自动测试设备) 写入
 * @note PLL参数应由系统初始化代码加载到SYSPLLPARAM0/1寄存器
 */

#ifndef ti_devices_msp_peripherals_hw_factoryregion__include
#define ti_devices_msp_peripherals_hw_factoryregion__include

/* This preliminary header file does not have a version number */
/* MMR repo: https://bitbucket.itg.ti.com/projects/cmcu_msp65soc/repos/trim_platform_constants */
/* MMR revision: ff4b6bcad5d93ca548bdb94b818a30dc3f4acd3f */
/* Generator revision: c98c4ac511e2bd0d918c5d427bd46b7a359dacf1
   (MInT: ec7ec7482a60c6871be32db8b378ec27aa4771f6) */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* FACTORYREGION Registers — 工厂配置区域寄存器结构体定义
* 包含: 设备ID、BSL配置、PLL参数、存储器大小、温度校准、引导CRC
******************************************************************************/
#define FACTORYREGION_OPEN_OFS                   ((uint32_t)0x41C40000U)


/** @addtogroup FACTORYREGION_OPEN
  @{
*/

typedef struct {
#if (DeviceFamily_PARENT == DeviceFamily_PARENT_MSPM0G352X)
  __I  uint32_t USERID;                            /* !< (@ 0x41C40000) 用户标识 (器件变体/版本号) */
#else
  __I  uint32_t TRACEID;                           /* !< (@ 0x41C40000) ATE追踪ID (基于晶圆的唯一标识) */
#endif
  __I  uint32_t DEVICEID;                          /* !< (@ 0x41C40004) 设备ID (JTAG ID Code，含制造商/部件号/版本) */
#if (DeviceFamily_PARENT == DeviceFamily_PARENT_MSPM0G352X)
  __I  uint32_t TRACEID;                           /* !< (@ 0x41C40008) ATE追踪ID (基于晶圆的唯一标识) */
#else
  __I  uint32_t USERID;                            /* !< (@ 0x41C40008) 用户标识 (器件变体/版本号) */
#endif
  __I  uint32_t BSLPIN_UART;                       /* !< (@ 0x41C4000C) BSL UART引脚配置 (RXD/TXD引脚及功能选择) */
  __I  uint32_t BSLPIN_I2C;                        /* !< (@ 0x41C40010) BSL I2C引脚配置 (SDA/SCL引脚及功能选择) */
  __I  uint32_t BSLPIN_INVOKE;                     /* !< (@ 0x41C40014) BSL调用引脚配置 (引脚号/电平/GPIO选择) */
  __I  uint32_t SRAMFLASH;                         /* !< (@ 0x41C40018) 存储器大小配置 (Flash/SRAM容量及Bank数) */
  __I  uint32_t PLLSTARTUP0_4_8MHZ;                /* !< (@ 0x41C4001C) PLL参数0: 4-8MHz范围 (启动时间/电荷泵/电容) */
  __I  uint32_t PLLSTARTUP1_4_8MHZ;                /* !< (@ 0x41C40020) PLL参数1: 4-8MHz范围 (环路滤波器参数) */
  __I  uint32_t PLLSTARTUP0_8_16MHZ;               /* !< (@ 0x41C40024) PLL参数0: 8-16MHz范围 */
  __I  uint32_t PLLSTARTUP1_8_16MHZ;               /* !< (@ 0x41C40028) PLL参数1: 8-16MHz范围 */
  __I  uint32_t PLLSTARTUP0_16_32MHZ;              /* !< (@ 0x41C4002C) PLL参数0: 16-32MHz范围 */
  __I  uint32_t PLLSTARTUP1_16_32MHZ;              /* !< (@ 0x41C40030) PLL参数1: 16-32MHz范围 */
  __I  uint32_t PLLSTARTUP0_32_48MHZ;              /* !< (@ 0x41C40034) PLL参数0: 32-48MHz范围 */
  __I  uint32_t PLLSTARTUP1_32_48MHZ;              /* !< (@ 0x41C40038) PLL参数1: 32-48MHz范围 */
  __I  uint32_t TEMP_SENSE0;                       /* !< (@ 0x41C4003C) 温度传感器室温校准码 (ADC转换结果) */
  __I  uint32_t RESERVED0;                         /* !< (@ 0x41C40040) 保留 */
  __I  uint32_t RESERVED1;                         /* !< (@ 0x41C40044) 保留 */
  __I  uint32_t RESERVED2;                         /* !< (@ 0x41C40048) 保留 */
  __I  uint32_t RESERVED3;                         /* !< (@ 0x41C4004C) 保留 */
  __I  uint32_t RESERVED4;                         /* !< (@ 0x41C40050) 保留 */
  __I  uint32_t RESERVED5;                         /* !< (@ 0x41C40054) 保留 */
  __I  uint32_t RESERVED6;                         /* !< (@ 0x41C40058) 保留 */
  __I  uint32_t RESERVED7;                         /* !< (@ 0x41C4005C) 保留 */
  __I  uint32_t RESERVED8;                         /* !< (@ 0x41C40060) 保留 */
  __I  uint32_t RESERVED9;                         /* !< (@ 0x41C40064) 保留 */
  __I  uint32_t RESERVED10;                        /* !< (@ 0x41C40068) 保留 */
  __I  uint32_t RESERVED11;                        /* !< (@ 0x41C4006C) 保留 */
  __I  uint32_t RESERVED12;                        /* !< (@ 0x41C40070) 保留 */
  __I  uint32_t RESERVED13;                        /* !< (@ 0x41C40074) 保留 */
  __I  uint32_t RESERVED14;                        /* !< (@ 0x41C40078) 保留 */
  __I  uint32_t BOOTCRC;                           /* !< (@ 0x41C4007C) 引导CRC: OPEN区域全部地址的32位CRC校验值 */
} FACTORYREGION_OPEN_Regs;

/*@}*/ /* end of group FACTORYREGION_OPEN */

