zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/m0p/hw_factoryregion.h
/* FACTORYREGION_PLLSTARTUP1_32_48MHZ Bits */
/* FACTORYREGION_PLLSTARTUP1_32_48MHZ[LPFCAPA] Bits */
#define FACTORYREGION_PLLSTARTUP1_32_48MHZ_LPFCAPA_OFS (0)                             /* !< LPFCAPA Offset */
#define FACTORYREGION_PLLSTARTUP1_32_48MHZ_LPFCAPA_MASK ((uint32_t)0x0000001FU)         /* !< Loop Filter Cap A */
/* FACTORYREGION_PLLSTARTUP1_32_48MHZ[LPFRESA] Bits */
#define FACTORYREGION_PLLSTARTUP1_32_48MHZ_LPFRESA_OFS (8)                             /* !< LPFRESA Offset */
#define FACTORYREGION_PLLSTARTUP1_32_48MHZ_LPFRESA_MASK ((uint32_t)0x0003FF00U)         /* !< Loop Filter Res A */
/* FACTORYREGION_PLLSTARTUP1_32_48MHZ[LPFRESC] Bits */
#define FACTORYREGION_PLLSTARTUP1_32_48MHZ_LPFRESC_OFS (24)                            /* !< LPFRESC Offset */
#define FACTORYREGION_PLLSTARTUP1_32_48MHZ_LPFRESC_MASK ((uint32_t)0xFF000000U)         /* !< Loop Filter Res C */

/*—————————————————————————————————————————————————————————————————————————————
 * TEMP_SENSE0 (温度传感器校准寄存器，只读)
 * 室温下的ADC转换结果，用于温度计算的基准值
 *—————————————————————————————————————————————————————————————————————————————*/
/* FACTORYREGION_TEMP_SENSE0[DATA] — 温度传感器校准数据 [31:0] */
#define FACTORYREGION_TEMP_SENSE0_DATA_OFS       (0)                             /* !< DATA Offset */
#define FACTORYREGION_TEMP_SENSE0_DATA_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< 室温ADC校准值 */

/*—————————————————————————————————————————————————————————————————————————————
 * BOOTCRC (引导CRC校验寄存器，只读)
 * OPEN区域全部地址 (含保留区域) 的32位CRC校验值
 *—————————————————————————————————————————————————————————————————————————————*/
/* FACTORYREGION_BOOTCRC[DATA] — CRC校验值 [31:0] */
#define FACTORYREGION_BOOTCRC_DATA_OFS           (0)                             /* !< DATA Offset */
#define FACTORYREGION_BOOTCRC_DATA_MASK          ((uint32_t)0xFFFFFFFFU)         /* !< 32位CRC校验值 */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_factoryregion__include */
